In [138]:
import pandas as pd
import numpy as np

In [139]:
A=pd.Series(['a','b','c'])

In [140]:
A

0    a
1    b
2    c
dtype: object

In [141]:
B=["apple",'ball','cat']

In [142]:
C=pd.Series(data=B,index=A)

In [143]:
B

['apple', 'ball', 'cat']

In [144]:
C

a    apple
b     ball
c      cat
dtype: object

In [145]:
B=pd.Series([1,2,3,4],index=[1,4,9,16])

In [146]:
B

1     1
4     2
9     3
16    4
dtype: int64

In [147]:
B

1     1
4     2
9     3
16    4
dtype: int64

In [148]:
B

1     1
4     2
9     3
16    4
dtype: int64

In [149]:
B[4]

2

In [150]:
BB=pd.Series([1,2,5,6],index=[1,4,25,36])

In [151]:
B+BB

1     2.0
4     4.0
9     NaN
16    NaN
25    NaN
36    NaN
dtype: float64

In [152]:
sa=pd.DataFrame(np.random.randn(5,5),['A','B','D','E','F'],['G','H','I','J','K'])

In [153]:
sa

          G         H         I         J         K
A -0.192230 -0.283413  1.733567  0.532264  0.944199
B -0.862173  0.563531  0.014558  0.184152  0.672081
D  1.065727  0.138235  2.834243  1.550063  1.388379
E  0.328713  0.001141  0.251145 -0.162319 -1.690395
F -0.532164  0.144884  0.083110 -0.472178 -0.610393

In [154]:
sa[['G','H']]

          G         H
A -0.192230 -0.283413
B -0.862173  0.563531
D  1.065727  0.138235
E  0.328713  0.001141
F -0.532164  0.144884

In [155]:
sa.drop('K',axis=1)

          G         H         I         J
A -0.192230 -0.283413  1.733567  0.532264
B -0.862173  0.563531  0.014558  0.184152
D  1.065727  0.138235  2.834243  1.550063
E  0.328713  0.001141  0.251145 -0.162319
F -0.532164  0.144884  0.083110 -0.472178

In [156]:
sa.drop(['K','H'],axis=1,inplace=True)

In [157]:
sa

          G         I         J
A -0.192230  1.733567  0.532264
B -0.862173  0.014558  0.184152
D  1.065727  2.834243  1.550063
E  0.328713  0.251145 -0.162319
F -0.532164  0.083110 -0.472178

In [158]:
sa.drop('I',axis=1)

          G         J
A -0.192230  0.532264
B -0.862173  0.184152
D  1.065727  1.550063
E  0.328713 -0.162319
F -0.532164 -0.472178

In [159]:
sa.drop('F')

          G         I         J
A -0.192230  1.733567  0.532264
B -0.862173  0.014558  0.184152
D  1.065727  2.834243  1.550063
E  0.328713  0.251145 -0.162319

In [160]:
sa.loc['A']

G   -0.192230
I    1.733567
J    0.532264
Name: A, dtype: float64

In [161]:
sa.iloc[0]

G   -0.192230
I    1.733567
J    0.532264
Name: A, dtype: float64

In [162]:
sa.loc[['A','B'],['G','I']]

          G         I
A -0.192230  1.733567
B -0.862173  0.014558

In [163]:
sa.reset_index()

  index         G         I         J
0     A -0.192230  1.733567  0.532264
1     B -0.862173  0.014558  0.184152
2     D  1.065727  2.834243  1.550063
3     E  0.328713  0.251145 -0.162319
4     F -0.532164  0.083110 -0.472178

In [164]:
ana="Hyd che ban mys guj".split()

In [165]:
ana

['Hyd', 'che', 'ban', 'mys', 'guj']

In [166]:
sa['new']=ana

In [167]:
sa

          G         I         J  new
A -0.192230  1.733567  0.532264  Hyd
B -0.862173  0.014558  0.184152  che
D  1.065727  2.834243  1.550063  ban
E  0.328713  0.251145 -0.162319  mys
F -0.532164  0.083110 -0.472178  guj

In [168]:
sa.set_index('new')

            G         I         J
new
Hyd -0.192230  1.733567  0.532264
che -0.862173  0.014558  0.184152
ban  1.065727  2.834243  1.550063
mys  0.328713  0.251145 -0.162319
guj -0.532164  0.083110 -0.472178

In [169]:
sa

          G         I         J  new
A -0.192230  1.733567  0.532264  Hyd
B -0.862173  0.014558  0.184152  che
D  1.065727  2.834243  1.550063  ban
E  0.328713  0.251145 -0.162319  mys
F -0.532164  0.083110 -0.472178  guj

In [170]:
sa>0

       G     I      J   new
A  False  True   True  True
B  False  True   True  True
D   True  True   True  True
E   True  True  False  True
F  False  True  False  True

In [171]:
sa[sa>0]

          G         I         J  new
A       NaN  1.733567  0.532264  Hyd
B       NaN  0.014558  0.184152  che
D  1.065727  2.834243  1.550063  ban
E  0.328713  0.251145       NaN  mys
F       NaN  0.083110       NaN  guj

In [172]:
sa[sa['G']>0]

          G         I         J  new
D  1.065727  2.834243  1.550063  ban
E  0.328713  0.251145 -0.162319  mys

In [173]:
sa[sa['G']>0][['I','J']]

          I         J
D  2.834243  1.550063
E  0.251145 -0.162319

In [175]:
sa[(sa['J']<0) & sa(sa['I']>0)]

TypeError: 'DataFrame' object is not callable

In [176]:
DAS= pd.DataFrame(np.random.randn(5,5),['A','B','C','D','E'],['F','G','H','I','J'])

In [177]:
DAS

          F         G         H         I         J
A  0.498859 -1.164940  1.671353  1.493445  1.086080
B -1.363253  1.848128  0.712037 -0.716323  2.102603
C -0.159792  0.868236  0.206430 -1.319515  1.162106
D -0.921861  0.840090  2.628786  0.849110 -0.278195
E  1.267013  0.043904 -1.307263 -0.183846  1.178275

In [180]:
DAS[(DAS['F']>0) & (DAS['H']>0) ]

          F        G         H         I        J
A  0.498859 -1.16494  1.671353  1.493445  1.08608

In [181]:
DAS[(DAS['F']>0) | (DAS['H']>0) ]

          F         G         H         I         J
A  0.498859 -1.164940  1.671353  1.493445  1.086080
B -1.363253  1.848128  0.712037 -0.716323  2.102603
C -0.159792  0.868236  0.206430 -1.319515  1.162106
D -0.921861  0.840090  2.628786  0.849110 -0.278195
E  1.267013  0.043904 -1.307263 -0.183846  1.178275